{
    "experience": [
        {
            "year": "January 2023 - Present (Front-End Engineer)",
            "companyName": "JMR",
            "location": "Dhaka,Bangladesh",
            "role1": "Implemented efficient data fetching strategies from APIs and databases, facilitating dynamic content display and real-time updates.",
            "role2": "Spearheaded the development and redesign of e-commerce, food delivery, courier service, and admin panel websites, achieving a seamless user experience for a diverse user base.",
            "role3": "Leveraged cutting-edge technologies such as React, Next, Tailwind, and other frameworks to implement innovative features and elevate platform performance.",
            "role4": "Ensured robust cross-browser compatibility and responsive design, optimizing user engagement across various devices.",
            "role5": "Collaborated closely with cross-functional teams, including designers, developers, and stakeholders, to achieve project milestones.",
            "role6": "Mentored and guided junior developers, fostering skill enhancement and a collaborative team environment",
            "techStack": [
                {
                    "stack1": "REACT JS",
                    "stack2": "NEXT JS",
                    "stack3": "SCSS",
                    "stack4": "ANT DESIGN",
                    "stack5": "CSS3"
                }
            ]
        },
        {
            "year": "June 2023 - Nov 2023 (Front-End Engineer)",
            "companyName": "Remote",
            "location": "Ukraine,kyiv",
            "role1": "Successfully delivered 8+ responsive and interactive React, HTML, CSS, and JavaScript websites, showcasing meticulous attention to pixel-perfect UI implementation",
            "role2": "Ensured consistent and flawless UI design across various devices, emphasizing a visually appealing and user-friendly experience.",
            "role3": "Led comprehensive code reviews, offering constructive feedback to enhance overall codebase quality.",
            "role4": "Played a key role in project planning and decision-making processes, contributing to technical strategies.",
            "role5": "Explored and implemented emerging technologies, ensuring the incorporation of the latest trends in web development for future-proof solutions.",
            "techStack": [
                {
                    "stack1": "HTML5",
                    "stack2": "CSS3",
                    "stack3": "JAVASCRIPT",
                    "stack4": "BOOTSTRAP",
                    "stack5": "SCSS"
                }
            ]
        },
        {
            "year": "May 2019 - Dec 2022 (Front-End Engineer)",
            "companyName": "TigerIT Bangladesh Ltd.",
            "location": "Dhaka,Bangladesh",
            "role1": "Collaborated seamlessly with design, product, and back-end teams to conceptualize and deliver 5+ web and cross-platform products.",
            "role2": "Spearheaded a remarkable 95% improvement in Performance, Accessibility, and SEO, surpassing Lighthouse standards.",
            "role3": "Developed a robust admin system for managing 300+ employee details using a combination of HTML, CSS, and JS.",
            "role4": "Consumed and integrated RESTful APIs into JS applications, optimizing for maximum speed.",
            "role5": "Designed and implemented a cross-platform app using Ionic, React, and SCSS for efficient daily task assignments.",
            "techStack": [
                {
                    "stack1": "REACT JS",
                    "stack2": "JAVASCRIPT",
                    "stack3": "REACT BOOTSTRAP",
                    "stack4": "HTML5",
                    "stack5": "CSS3"
                }
            ]
        }
    ]
}